lib/xml/modifyVCCConfiguration.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:ser="http://service.admin.ws.five9.com/">
    <soapenv:Header/>
    <soapenv:Body>
        <ser:modifyVCCConfiguration>
            <!--Optional:-->
            <configuration>
                <!--Optional:-->
                <agentProductivity>
                    <!--Optional:-->
                    <longACWTime>?</longACWTime>
                    <!--Optional:-->
                    <longCallDuration>?</longCallDuration>
                    <!--Optional:-->
                    <longHoldDuration>?</longHoldDuration>
                    <!--Optional:-->
                    <longParkDuration>?</longParkDuration>
                    <!--Optional:-->
                    <shortACWTime>?</shortACWTime>
                    <!--Optional:-->
                    <shortCallDuration>?</shortCallDuration>
                </agentProductivity>
                <!--Optional:-->
                <campaignsSettings>
                    <!--Optional:-->
                    <gracefulAgentStateTransitionDelay>?</gracefulAgentStateTransitionDelay>
                    <!--Optional:-->
                    <gracefulAgentStateTransitionModeEnabled>?</gracefulAgentStateTransitionModeEnabled>
                    <!--Optional:-->
                    <priorityEnabled>?</priorityEnabled>
                    <!--Optional:-->
                    <ratioEnabled>?</ratioEnabled>
                </campaignsSettings>
                <!--Optional:-->
                <domainId>?</domainId>
                <!--Optional:-->
                <domainName>?</domainName>
                <!--Optional:-->
                <emailProperties>
                    <!--Optional:-->
                    <emailAddress>?</emailAddress>
                    <!--Optional:-->
                    <maxAttachmentSize>?</maxAttachmentSize>
                    <!--Optional:-->
                    <newUserNotification>?</newUserNotification>
                </emailProperties>
                <!--Optional:-->
                <extensionSettings>
                    <!--Optional:-->
                    <maximalExtensionLength>?</maximalExtensionLength>
                    <!--Optional:-->
                    <minimalExtensionLength>?</minimalExtensionLength>
                    <!--Optional:-->
                    <minimalGeneratedExtension>?</minimalGeneratedExtension>
                </extensionSettings>
                <!--Optional:-->
                <keyPerfomanceIndicators>
                    <!--Optional:-->
                    <minTimeOfResponse>?</minTimeOfResponse>
                    <!--Optional:-->
                    <speedOfAnswer>?</speedOfAnswer>
                </keyPerfomanceIndicators>
                <!--Optional:-->
                <miscOptions>
                    <!--Optional:-->
                    <defaultCampaign>?</defaultCampaign>
                    <!--Optional:-->
                    <enableReasonCodes>?</enableReasonCodes>
                    <!--Optional:-->
                    <internalCallTimeout>?</internalCallTimeout>
                    <!--Optional:-->
                    <maySelectCampaign>?</maySelectCampaign>
                    <!--Optional:-->
                    <maySelectNone>?</maySelectNone>
                    <!--Optional:-->
                    <showDialAttempts>?</showDialAttempts>
                    <!--Optional:-->
                    <voicemailTimeout>?</voicemailTimeout>
                </miscOptions>
                <!--Optional:-->
                <passwordPolicies>
                    <!--Optional:-->
                    <adminLoginAttempts>?</adminLoginAttempts>
                    <!--Optional:-->
                    <enforcePasswordHistory>?</enforcePasswordHistory>
                    <!--Optional:-->
                    <loginAttempts>?</loginAttempts>
                    <!--Optional:-->
                    <minCapitalCharacters>?</minCapitalCharacters>
                    <!--Optional:-->
                    <minNumberCharacters>?</minNumberCharacters>
                    <!--Optional:-->
                    <minPasswordLength>?</minPasswordLength>
                    <!--Optional:-->
                    <minSpecialCharacters>?</minSpecialCharacters>
                    <!--Optional:-->
                    <passwordExpires>?</passwordExpires>
                </passwordPolicies>
                <!--Optional:-->
                <recordingsServer>
                    <!--Optional:-->
                    <hostName>?</hostName>
                    <!--Optional:-->
                    <password>?</password>
                    <!--Optional:-->
                    <userName>?</userName>
                </recordingsServer>
                <!--Optional:-->
                <reportsServer>
                    <!--Optional:-->
                    <hostName>?</hostName>
                    <!--Optional:-->
                    <password>?</password>
                    <!--Optional:-->
                    <userName>?</userName>
                </reportsServer>
                <!--Optional:-->
                <saleforceEmailAccount>
                    <!--Optional:-->
                    <consumerKey>?</consumerKey>
                    <!--Optional:-->
                    <consumerSecret>?</consumerSecret>
                    <enabled>?</enabled>
                    <!--Optional:-->
                    <password>?</password>
                    <!--Optional:-->
                    <securityToken>?</securityToken>
                    <!--Optional:-->
                    <userName>?</userName>
                </saleforceEmailAccount>
                <!--Optional:-->
                <stateDialingRule>?</stateDialingRule>
                <!--Optional:-->
                <timeZoneAssignment>?</timeZoneAssignment>
                <!--Optional:-->
                <transcriptsServer>
                    <!--Optional:-->
                    <hostName>?</hostName>
                    <!--Optional:-->
                    <password>?</password>
                    <!--Optional:-->
                    <userName>?</userName>
                </transcriptsServer>
            </configuration>
        </ser:modifyVCCConfiguration>
    </soapenv:Body>
</soapenv:Envelope>